TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/ПроверкаЦен/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;


//&НаСервере
//Процедура ЗаполнитьДокумент(Отказ)
//	
//	//ВидДокумента = Параметры.ВидДокумента;
//	ДокументUUID  = Параметры.ДокументUUID;
//	ДокументСервер = Истина; 
//	//ДатаДокумента = ТекущаяДата();
//	//
//	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(Параметры);
//	// 
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;

    Параметры.Свойство("ДокументUUID", ИД_Задания);
    Параметры.Свойство("ОписаниеЗадания", ОписаниеЗадания);

    Если Параметры.Свойство("ВидДокумента") Тогда
        ЗаданиеВерификации =  ?(Параметры.ВидДокумента = "ЗаданиеВФ", Истина, Ложь);
    КонецЕсли;
	
	//Если ЗаданиеВерификации Тогда
	//	ЗаполнитьДокумент(Отказ);
	//КонецЕсли;

    НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
    НастроитьФормуПоОриентацииЭкрана();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

    Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
        ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
    КонецЕсли;

    ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()

    ИнициализироватьАсинхронныйСканер();

КонецПроцедуры
&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
    ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
    Инициализирован = Не ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);
    ОбновитьПодразделение();
    ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	//(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	//);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаВозвр30", "Видимость", Ложь);
    ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтотОбъект, "СтрокаНаименование");
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "Сканировать", "Видимость",
        (ЕстьОборудованиеСканирования И Не ИспользуетсяАсинхронныйСканер) И Инициализирован);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТовары", "Видимость",
        ПоказатьСписок);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаСканирование", "Видимость",
        Не ПоказатьСписок);

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ФормаПередатьНаСервер,ОписаниеЗадания",
        "Видимость", Не ЗаданиеВерификации);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ФормаВыполнитьЗадание,ОписаниеЗадания",
        "Видимость", ЗаданиеВерификации);
    НастроитьЭлементыАсинхронногоСканера();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()

    Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
        Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Ложь;
    Иначе
        Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Истина;

    КонецЕсли;
    ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "Сканировать", "Доступность",
        (ЕстьОборудованиеСканирования И Не ИспользуетсяАсинхронныйСканер) И Инициализирован);
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "АктивироватьСканер", "Видимость",
        ИспользуетсяАсинхронныйСканер);

КонецПроцедуры
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

    Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда

        ДополнительныеПараметры = Новый Структура;
        ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
        ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);

    ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда

        ОбновитьПодразделение();

    КонецЕсли;
КонецПроцедуры



#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
    Если ПустаяСтрока( ПолученныйШтрихкод) Тогда
        ЗвукОшибки();

        Возврат;
    КонецЕсли;

    Если ЗаданиеВерификации Тогда
        ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод, , Истина, ИД_Задания);
    Иначе
        ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод, , Истина);
    КонецЕсли;
    ОбработатьПолученныеДанные(ДанныеПоТовару, Параметры);

КонецПроцедуры

&НаКлиенте
Процедура Сканер(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
    Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеУстановленСканерНажатие(Элемент)
    ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов", , ЭтотОбъект, , , , ,
        РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры) Экспорт

    Если ДанныеПоТовару.Результат = Ложь Тогда
        Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,
            "Данные по штрих коду не получены"));
        ЗвукОшибки();

        Возврат;
    КонецЕсли;
    СтруктураОтвета = ДанныеПоТовару.Ответ;

    Если СтруктураОтвета.Свойство("АМ") Тогда
        ЦветАМ = ?(СтруктураОтвета.АМ = 0, WebЦвета.Красный, WebЦвета.Синий);
        Элементы.ДекорацияАМ.ЦветФона 		  = ЦветАМ;
    КонецЕсли;

    Если СтруктураОтвета.Свойство("СрокВозврата") Тогда
        УсловиеВозврата = СтруктураОтвета.СрокВозврата;
        ДатаВозврата = ?(УсловиеВозврата = 0, "ДО ПРОСРОКА", Формат(ТекущаяДата() + (60 * 60 * 24 * УсловиеВозврата),
            "ДФ=dd.MM.yy"));
    Иначе
        ДатаВозврата = Неопределено;
        УсловиеВозврата = 0;
    КонецЕсли;

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаВозвр30", "Видимость",
        УсловиеВозврата = 30);
    нСтрока = Товары.Добавить();
    ЗаполнитьЗначенияСвойств(нСтрока, СтруктураОтвета);
    ИдентификаторСтроки = нСтрока.ПолучитьИдентификатор();
    ОбработатьНовуюСтроку(ИдентификаторСтроки);

#Если МобильноеПриложениеКлиент Тогда
    Если Подсветка Тогда
        ЗвукОшибки();
    КонецЕсли;
#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьМакетВоВременноеХранилище(ИмяМакета) Экспорт

    Макет = ПолучитьОбщийМакет(ИмяМакета);
    АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Макет);
    Возврат АдресФайлаВХранилище;

КонецФункции
&НаКлиенте
Процедура ЗвукОшибки()

#Если МобильноеПриложениеКлиент Тогда

    СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение("errorscan", Истина);

#КонецЕсли
КонецПроцедуры
&НаСервере
Процедура ОбработатьНовуюСтроку(ИдентификаторСтроки)
    ЗаписьПоСтроке = НСтр("ru = '%Артикул% %Номенклатура% %Еденица%'");
    ЗаписьПоСтрокеЦенаОстаток = НСтр("ru = 'Цена %Цена% ост. %Остаток%'");
    СтрокаТовара = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);

    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Еденица%", Строка(СтрокаТовара.Еденица));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Артикул%", Строка(СтрокаТовара.Артикул));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Номенклатура%", Строка(СтрокаТовара.НаименованиеТовара));
    ЗаписьПоСтрокеЦенаОстаток = СтрЗаменить(ЗаписьПоСтрокеЦенаОстаток, "%Цена%", Формат(СтрокаТовара.Цена,
        ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
    ЗаписьПоСтрокеЦенаОстаток = СтрЗаменить(ЗаписьПоСтрокеЦенаОстаток, "%Остаток%", Формат(СтрокаТовара.Остаток,
        ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	//

    СтрокаТовара.ЗаписьПоСтроке = ЗаписьПоСтроке;
    СтрокаТовара.ЗаписьПоСтрокеЦенаОстаток = ЗаписьПоСтрокеЦенаОстаток;
    СтрокаНаименование = "[" + СтрокаТовара.Артикул + "]" + " " + "[" + СтрокаТовара.ШтрихКод + "]" + Символы.ПС
        + СтрокаТовара.НаименованиеТовара;
    Цена = Формат(СтрокаТовара.Цена, "ЧЦ=15; ЧДЦ=2; ЧН=");
    ЦенаЦенник = Формат(СтрокаТовара.ЦенаЦенник, "ЧЦ=15; ЧДЦ=2; ЧН=");
    Остаток = Формат(СтрокаТовара.Остаток, "ЧЦ=15; ЧДЦ=3; ЧН=");

    ОстатокТНП = Формат(СтрокаТовара.ОстатокТНП, "ЧЦ=15; ЧДЦ=3; ЧН=");

    Отсканировано = Товары.Количество();
    ОтсканированоНеПравильных = Товары.НайтиСтроки(Новый Структура("ЕстьСверка,БезЦенника,ЦенаПроверена", Истина, Ложь,
        Ложь)).Количество();
    ОтсканированоБезЦенников  = Товары.НайтиСтроки(Новый Структура("БезЦенника", Истина)).Количество();
    Если СтрокаТовара.ЕстьСверка И Не СтрокаТовара.БезЦенника И Не СтрокаТовара.ЦенаПроверена Тогда
        Подсветка = Истина;
    Иначе
        Подсветка = Ложь;
    КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура АктивироватьСканер(Команда)

    ИнициализироватьАсинхронныйСканер();

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()

    ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
    ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма, , , , ,
        РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
		// ОриентацияЭкрана
    ПриИзмененииПараметровЭкранаСервер();

КонецПроцедуры
&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()

    ОбщегоНазначения.УстановитьОриентациюЭкрана();
    НастроитьФормуПоОриентацииЭкрана();

КонецПроцедуры
&НаКлиенте
Процедура Готово(Команда)
    ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
    ИдетПроцессСканирования = Истина;
    ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
    ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
    ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
    ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");

    ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры
&НаСервере
Функция ПечататьВсеНаСервере()

    МассивСтрок = Новый Массив;
    Для Каждого СтрТовары Из Товары Цикл
        МассивСтрок.Добавить(СтрТовары.Артикул);
    КонецЦикла;

    Ответ =  ИнтеграцияТК_ВызовСервера.ПечатьЦенниковОбъекта(МассивСтрок);
    Если Ответ.Результат Тогда
        ТабДок = Ответ.Ответ;
        ТабДок.АвтоМасштаб = Истина;
		
	//	ТабДок.ИмяПринтера = "10.148.221.64";
    Иначе
        ТабДок = Неопределено;
    КонецЕсли;
    Возврат ТабДок;

КонецФункции
&НаКлиенте
Процедура ПечататьВсе(Команда)

	//
	//ТабДок = ПечататьВсеНаСервере();
	//Если ТабДок <> Неопределено Тогда
	//	ПараметрыФормы = Новый Структура("ТабличныйДокумен",ТабДок);
	//	ОПЗакрытия = Новый ОписаниеОповещения("ВыполнитьЗакрытиеПечати",ЭтотОбъект);
	//	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыФормы,ЭтаФорма,,,,ОПЗакрытия,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ВыполнитьЗакрытиеПечати(Результат, Параметры) Экспорт
    Если Результат = "ОК" Тогда

    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПередатьНаСерверНаСервере()
    МассивТоваров = Новый Массив;
    Для Каждого СтрТовары Из Товары Цикл
        Если (СтрТовары.ЕстьСверка И Не СтрТовары.ЦенаПроверена) Или СтрТовары.БезЦенника Тогда

            МассивТоваров.Добавить(Новый Структура("Артикул,МРЦ", СтрТовары.Артикул, ""));
        КонецЕсли;
    КонецЦикла;

    СтруктураДокумента = Новый Структура;
    СтруктураДокумента.Вставить("ТипДокумента", "ПечатьЦенников");
    СтруктураДокумента.Вставить("Товары", МассивТоваров);
    Ответ =  ИнтеграцияТК_ВызовСервера.ПередатьТоварыДляЦенников(СтруктураДокумента);
    Если Ответ.Результат Тогда
        Товары.Очистить();
        Отсканировано = Товары.Количество();
        ОтсканированоНеПравильных = 0;
        ОтсканированоБезЦенников  = 0;
        Подсветка = Ложь;
        СтрокаНаименование = "";
        Если ЗаданиеВерификации Тогда

            СтруктураДокумента = Новый Структура("UUID_Документ,ДоументСервер", ИД_Задания, Ложь);
            Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,
                Справочники.ТипыДокументов.ЗаданиеВФ);

            Возврат Рез.Результат;
        Иначе
            Сообщить("Отправлено на печать");

        КонецЕсли;
    Иначе
        Сообщить(Ответ.ОписаниеОшибки);
    КонецЕсли;

    Возврат Истина;

КонецФункции

&НаСервере
Функция ПолучитьТаблицуЦенниковДляПечати()

    Если ПечататьВсеЦенники Тогда
        тзТипыЦенников = Товары.Выгрузить( , "СпецЦена");
    Иначе

        тзТипыЦенников = Новый ТаблицаЗначений;
        тзТипыЦенников.Колонки.Добавить("СпецЦена");
        Для Каждого стрТовары Из Товары Цикл
            Если стрТовары.ЦенаПроверена = Ложь Или стрТовары.БезЦенника Тогда
                тзстрТипыЦенников =  тзТипыЦенников.Добавить();
                тзстрТипыЦенников.СпецЦена = стрТовары.СпецЦена;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    тзТипыЦенников.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0,
        ДопустимыйЗнак.Любой)));
    тзТипыЦенников.ЗаполнитьЗначения(1, "Количество");
    тзТипыЦенников.Свернуть("СпецЦена", "Количество");

    Возврат тзТипыЦенников;
КонецФункции

&НаСервере
Функция СписокЦенников()

    ТзТипыЦенников = ПолучитьТаблицуЦенниковДляПечати();
    ВариантыПечати = ПечатьЦенникиСервер.ПолучитьСписокВариантовПечати(тзТипыЦенников);

    Возврат ВариантыПечати;

КонецФункции
&НаКлиенте
Процедура ПередатьНаСервер(Команда)
    ВариантыПечати = СписокЦенников();
    Если ВариантыПечати.Количество() = 0 Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає цінників для друку");
        Возврат;
    КонецЕсли;

    ОповещениеПечати = Новый ОписаниеОповещения("ВыборВариантаПечатии", ЭтотОбъект, Новый Структура);

    ПоказатьВыборИзМеню(ОповещениеПечати, ВариантыПечати);

	//ПередатьНаСерверНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ВыборВариантаПечатии(ВариантыПечати, ПараметрыПечати) Экспорт
    Если ВариантыПечати = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Ответ = ПечатьНаСервере(ВариантыПечати.Значение);
    Если Ответ.Результат = Ложь Тогда
        Сообщить(Ответ.ОписаниеОшибки);
    Иначе
        Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
            ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Ответ.Ответ);
        Иначе
            Сообщить("Отправлено на печать");
        КонецЕсли;

    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ТипЦены)
    МассивТоваров = Новый Массив;
    нТовары = Новый Массив;

    Для Каждого СтрТовары Из Товары Цикл

        Если СтрТовары.СпецЦена <> ТипЦены Тогда
            Продолжить;
        КонецЕсли;
        флПечать = Ложь;
        Если ПечататьВсеЦенники Тогда
            флПечать = Истина;
        ИначеЕсли СтрТовары.СпецЦена = ТипЦены И (стрТовары.ЦенаПроверена = Ложь Или стрТовары.БезЦенника) Тогда
            флПечать = Истина;
        КонецЕсли;

        Если флПечать Тогда
            МассивТоваров.Добавить(Новый Структура("Артикул,МРЦ", СтрТовары.Артикул, ""));
            нТовары.Добавить(СтрТовары);

        КонецЕсли;

    КонецЦикла;
    СтруктураДокумента = Новый Структура;
    СтруктураДокумента.Вставить("Товары", МассивТоваров);
    СтруктураДокумента.Вставить("ИД_Переоценки", ТипЦены);

    Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда

        СтруктураДокумента.Вставить("ТипДокумента", "ПечатьЦенниковТСД");
        Ответ =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);

    Иначе

        СтруктураДокумента.Вставить("ТипДокумента", "ПечатьЦенников");

        Ответ =  ИнтеграцияТК_ВызовСервера.ПередатьТоварыДляЦенников(СтруктураДокумента);
    КонецЕсли;

    Если Ответ.Результат Тогда

        Для Каждого СтрТовары Из нТовары Цикл
            Товары.Удалить(СтрТовары);
        КонецЦикла;

        Отсканировано = Товары.Количество();
        ОтсканированоНеПравильных = 0;
        ОтсканированоБезЦенников  = 0;
        ЦенаЦенник = 0;
        Подсветка = Ложь;
        СтрокаНаименование = "";
        Цена = 0;
        Остаток = 0;
        ОстатокТНП = 0;
    КонецЕсли;
    Возврат Ответ;

КонецФункции
&НаКлиенте
Процедура ВыполнитьЗадание(Команда)
    Если ПередатьНаСерверНаСервере() Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть(Новый Структура("УдалитьСтроку"));
    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)

    Если ПустаяСтрока(СтрокаПоиска) Тогда
        Возврат;
    КонецЕсли;
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
    ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
    СтрокаПоиска = "";
    ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоиска;
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьСписокПриИзменении(Элемент)

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары", "Видимость", ПоказатьСписок);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование", "Видимость",
        Не ПоказатьСписок);

КонецПроцедуры
&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

КонецПроцедуры
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
#Если МобильноеПриложениеКлиент Тогда
#КонецЕсли

КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    Если Не ВыполняетсяЗакрытие И Товары.Количество() > 0 Тогда

        Отказ = Истина;

        ТекстВопроса = ?(ЗаданиеВерификации, "Выполнить задание?", "Сохранить данные?");

        ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса,
            РежимДиалогаВопрос.ДаНет);

    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДопоплнительныеПараметры) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда

        ПередатьНаСерверНаСервере();

    КонецЕсли;

    ВыполняетсяЗакрытие = Истина;
    Если ЗаданиеВерификации Тогда
        Закрыть(Новый Структура("УдалитьСтроку"));
    Иначе
        Закрыть();
    КонецЕсли;

КонецПроцедуры
